## Introduction

In this jupyter notebook we will go through the following topics :

      * Dataset overview

      * Reading csv into a pandas dataframe and doing the necessary data manipulations
      
      * Creating Database schema
      
      * Creating DDL(data definition languages) for each table and executing it programatically
      
      * Loading data into Postgres using psycopg2 
      
      * Executing SQL queries

## Dataset Overview

We will be using Netflix dataset for our project.

The netflix datset holds information about netflix movies and TV shows.

For our analysis, we will be first cleaning the source file and then creating the corresponding database and tables
in Postgres.


 ## Reading csv file to pandas dataframe

In [3]:
#Loading data from a CSV file into a Pandas DataFrame is achieved using the “read_csv” function in Pandas:

#Importing Pandas libraries with alias 'pd'
import pandas as pd

df = pd.read_csv('netflix_Tanisha_Genre.csv')
df

,Title,Genre,Languages,Type,Hidden Gem Score,Country Availability,Runtime,Director,Writer,View Rating,...,Netflix Release Date,Production House,Netflix Link,IMDb Link,Summary,IMDb Votes,Image,Poster,TMDb Trailer,Trailer Site
0,Lets Fight Ghost,Crime,Swedish,Series,4.3,Thailand,< 30 minutes,Tomas Alfredson,John Ajvide Lindqvist,R,...,3/4/2021,"Canal+, Sandrew Metronome",https://www.netflix.com/watch/81415947,https://www.imdb.com/title/tt1139797,A med student with a supernatural gift tries t...,205926.0,https://occ-0-4708-64.1.nflxso.net/dnm/api/v6/...,https://m.media-amazon.com/images/M/MV5BOWM4NT...,NaN,NaN
1,HOW TO BUILD A GIRL,Comedy,English,Movie,7.0,Canada,1-2 hour,Coky Giedroyc,Caitlin Moran,R,...,3/4/2021,"Film 4, Monumental Pictures, Lionsgate",https://www.netflix.com/watch/81041267,https://www.imdb.com/title/tt4193072,"When nerdy Johanna moves to London, things get...",2838.0,https://occ-0-1081-999.1.nflxso.net/dnm/api/v6...,https://m.media-amazon.com/images/M/MV5BZGUyN2...,https://www.youtube.com/watch?v=eIbcxPy4okQ,YouTube
2,Centigrade,Drama,English,Movie,6.4,Canada,1-2 hour,Brendan Walsh,Brendan Walsh,Unrated,...,3/4/2021,NaN,https://www.netflix.com/watch/81305978,https://www.imdb.com/title/tt8945942,"Trapped in a frozen car during a blizzard, a p...",1720.0,https://occ-0-1081-999.1.nflxso.net/dnm/api/v6...,https://m.media-amazon.com/images/M/MV5BODM2MD...,https://www.youtube.com/watch?v=0RvV7TNUlkQ,YouTube
3,ANNE+,Drama,Turkish,Series,7.7,Belgium,< 30 minutes,NaN,NaN,NaN,...,3/4/2021,NaN,https://www.netflix.com/watch/81336456,https://www.imdb.com/title/tt6132758,"Upon moving into a new place, a 20-something r...",1147.0,https://occ-0-1489-1490.1.nflxso.net/dnm/api/v...,https://m.media-amazon.com/images/M/MV5BNWRkMz...,NaN,NaN
4,Moxie,Animation,English,Movie,8.1,Lithuania,1-2 hour,Stephen Irwin,NaN,NaN,...,3/4/2021,NaN,https://www.netflix.com/watch/81078393,https://www.imdb.com/title/tt2023611,Inspired by her moms rebellious past and a con...,63.0,https://occ-0-4039-1500.1.nflxso.net/dnm/api/v...,https://m.media-amazon.com/images/M/MV5BODYyNW...,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15473,K-POP Extreme Survival,NaN,NaN,Series,NaN,South Korea,< 30 minutes,NaN,NaN,NaN,...,4/14/2015,NaN,https://www.netflix.com/watch/80031595,NaN,Seung Yeon decides to chase her dream of becom...,NaN,https://occ-0-2851-38.1.nflxso.net/dnm/api/v6/...,NaN,NaN,NaN
15474,DreamWorks Shreks Swamp Stories,NaN,NaN,Series,NaN,Russia,< 30 minutes,NaN,NaN,NaN,...,4/14/2015,NaN,https://www.netflix.com/watch/70242630,NaN,"Shrek celebrates Halloween, Puss in Boots is c...",NaN,https://occ-0-2851-38.1.nflxso.net/dnm/api/v6/...,NaN,NaN,NaN
15475,DreamWorks Happy Holidays from Madagascar,Animation,English,Series,8.4,Belgium,< 30 minutes,NaN,NaN,NaN,...,4/14/2015,NaN,https://www.netflix.com/watch/70259784,NaN,Madagascar goes wild with holiday spirit in th...,71.0,https://occ-0-2773-2774.1.nflxso.net/dnm/api/v...,NaN,NaN,NaN
15476,DreamWorks Holiday Classics,Animation,English,Series,8.2,Belgium,< 30 minutes,NaN,NaN,Unrated,...,4/14/2015,Fox,https://www.netflix.com/watch/70221348,NaN,Join your DreamWorks friends for these four ho...,82.0,https://occ-0-2851-38.1.nflxso.net/dnm/api/v6/...,NaN,NaN,NaN
15477,DreamWorks Kung Fu Panda Awesome Secrets,Animation,English,Series,8.1,Belgium,< 30 minutes,NaN,NaN,TV-PG,...,4/14/2015,NaN,https://www.netflix.com/watch/70241791,NaN,"In this pair of adventures, Po tells the story...",17.0,https://occ-0-2851-38.1.nflxso.net/dnm/api/v6/...,NaN,NaN,NaN

## Data Manipulations

Dropping the unnecessary columns

In [6]:
cols =  ['Hidden Gem Score', 'Rotten Tomatoes Score','Metacritic Score','Production House','Netflix Link','IMDb Link','Summary',
        'IMDb Votes','Image','Poster' , 'TMDb Trailer','Trailer Site','Release Date']
df.drop(cols,axis=1,inplace=True)

In [7]:
#Inspecting the shape after dropping the columns

df.shape

(15478, 14)

In [8]:
#Checking the percentage of missing values using isnull()

df.isnull().mean( )*100

Title                    0.000000
Genre                   11.047939
Languages               12.501615
Type                     0.000000
Country Availability     0.122755
Runtime                  0.006461
Director                30.410906
Writer                  27.962269
View Rating             45.367619
IMDb Score              13.548262
Awards Received         60.750743
Awards Nominated For    50.503941
Boxoffice               74.111642
Netflix Release Date     0.000000
dtype: float64

In [9]:
# Removing space from column names using replace() 

df.columns=df.columns.str.replace(' ', '')

In [10]:
#Checking the columns after removing spaces
df.columns

Index(['Title', 'Genre', 'Languages', 'Type', 'CountryAvailability', 'Runtime',
       'Director', 'Writer', 'ViewRating', 'IMDbScore', 'AwardsReceived',
       'AwardsNominatedFor', 'Boxoffice', 'NetflixReleaseDate'],
      dtype='object')

In [11]:
#Filling NaN values for the below columns with 0 using fillna()
columns = ['AwardsReceived' ,'AwardsNominatedFor']
df[columns] = df[columns].fillna(0)

#Checking the percentage of missing values using isnull() after fillna()
df.isnull().mean( )*100

#Changing datatypes for both columns from float to int after filling NAN values
df['AwardsNominatedFor'] = df['AwardsNominatedFor'].astype(int)
df['AwardsReceived'] = df['AwardsReceived'].astype(int)

#Checking the datatypes
#df.dtypes

In [12]:
#Checking the value count for ViewRating
#df['ViewRating'].value_counts()
#df['ViewRating'] = df['ViewRating'].str.replace('Not Rated' , 'Unrated')
#df['ViewRating'] = df['ViewRating'].str.replace('UNRATED' , 'Unrated')
#df['ViewRating'] = df['ViewRating'].str.replace('NOT RATED' , 'Unrated')


#Imputing NAN's for ViewRating with 'R'
import numpy as np
df['ViewRating'] = np.where(df['ViewRating'].isnull(),'R' ,df['ViewRating'])

#Checking the percentage of missing values 
df.isnull().mean()*100

Title                   0.000000
Genre                  11.047939
Languages              12.501615
Type                    0.000000
CountryAvailability     0.122755
Runtime                 0.006461
Director               30.410906
Writer                 27.962269
ViewRating              0.000000
IMDbScore              13.548262
AwardsReceived          0.000000
AwardsNominatedFor      0.000000
Boxoffice              74.111642
NetflixReleaseDate      0.000000
dtype: float64

In [13]:
#Checking value counts for Boxoffice 
df['Boxoffice'].value_counts()

#Removing dollar sign using replace()
df['Boxoffice']=df['Boxoffice'].str.replace('$' , '')
df['Boxoffice']

#Removing spaces
df['Boxoffice']=df['Boxoffice'].str.replace(',', '')

#Replacing NaN's with 0
import numpy as np
df['Boxoffice'] = np.where(df['Boxoffice'].isnull(),0 ,df['Boxoffice'])

<ipython-input-13-41a67d20c861>:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  df['Boxoffice']=df['Boxoffice'].str.replace('$' , '')

In [14]:
#Changing datatype for Boxoffice from object to int
df['Boxoffice'] = df['Boxoffice'].astype(int)

In [15]:
# Changing datatype for NetflixReleaseDate from object to datetime using to_datetime() 
df['NetflixReleaseDate'] = pd.to_datetime(df['NetflixReleaseDate'])

#Checking the datatypes
df.dtypes

#Extracting year from NetflixReleaseDate
df['Year'] = df['NetflixReleaseDate'].dt.year

In [16]:
#Removing characters from Runtime using Replace()
df['Runtime'] = df['Runtime'].str.replace(',','').str.replace('<','').str.replace('>','').str.replace('-',' ')
df['Runtime']

#Removing spaces
df['Runtime'] = df['Runtime'].str.replace(' ','')
df['Runtime']
#Replacing the values with (30minutes','30'),('1-2hour' , '120') ,('2hrs','170').Converting the values to minutes for different runtimes.
df['Runtime'] = df['Runtime'].str.replace('30minutes','30').str.replace('12hour' , '120').str.replace('2hrs','170')
df['Runtime']

0         30
1        120
2        120
3         30
4        120
        ...
15473     30
15474     30
15475     30
15476     30
15477     30
Name: Runtime, Length: 15478, dtype: object

In [18]:
#Checking value counts for Runtime
df['Runtime'].value_counts()

#Replacing NAN's with most frequent Runtime value
import numpy as np
df['Runtime'] = np.where(df['Runtime'].isnull(),120 ,df['Runtime'])

#Changing datatypes 
#df['Runtime'] = df['Runtime'].astype(int)

In [19]:
#Dropping not so relevant columns
cols = ['Writer','IMDbScore']
df.drop(cols,axis=1,inplace=True)

In [20]:
#Checknig value counts for Director
df['Director'].value_counts()

#Replacing NAN's with most frequent director value
import numpy as np
df['Director'] = np.where(df['Director'].isnull(),'Steven Spielberg ' ,df['Director'])

In [21]:
#Checking value counts for CountryAvailability
df['CountryAvailability'].value_counts()
df['CountryAvailability']
#Replacing NAN's with most frequent Country value
import numpy as np
df['CountryAvailability'] = np.where(df['CountryAvailability'].isnull(),'Japan' ,df['CountryAvailability'])

In [22]:
#Checking value counts for Languages
df['Languages'].value_counts()     

#Replacing NAN's with most frequent value for Languages
import numpy as np
df['Languages'] = np.where(df['Languages'].isnull(),'English' ,df['Languages'])

In [23]:
#Checking value counts for Genre
df['Genre'].value_counts()

#Replacing NAN's with most frequent value for Genre
import numpy as np
df['Genre'] = np.where(df['Genre'].isnull(),'Comedy' ,df['Genre'])

In [24]:
#Removing special characters from Title
df['Title'] = df['Title'].astype(str).replace('[^a-zA-Z0-9 ]', '', regex=True)

In [25]:
#Removing special characters from Director
df['Director'] = df['Director'].astype(str).replace('[^a-zA-Z0-9 ]', '', regex=True)

In [26]:
#After doing data manipulations,we are selcting a subset of data for exporting it to a csv and further creating tables 
#from it.

netflix_df=df.loc[0:1500,:]
netflix_df

,Title,Genre,Languages,Type,CountryAvailability,Runtime,Director,ViewRating,AwardsReceived,AwardsNominatedFor,Boxoffice,NetflixReleaseDate,Year
0,Lets Fight Ghost,Crime,Swedish,Series,Thailand,30,Tomas Alfredson,R,74,57,2122065,2021-03-04,2021
1,HOW TO BUILD A GIRL,Comedy,English,Movie,Canada,120,Coky Giedroyc,R,1,0,70632,2021-03-04,2021
2,Centigrade,Drama,English,Movie,Canada,120,Brendan Walsh,Unrated,0,0,16263,2021-03-04,2021
3,ANNE,Drama,Turkish,Series,Belgium,30,Steven Spielberg,R,1,0,0,2021-03-04,2021
4,Moxie,Animation,English,Movie,Lithuania,120,Stephen Irwin,R,0,4,0,2021-03-04,2021
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1496,The Exam,Drama,Hungarian,Movie,Hungary,120,Pter Bergendy,R,4,0,0,2020-09-09,2020
1497,Cargo,Drama,English,Movie,Lithuania,120,Ben Howling,TV-MA,1,17,0,2020-09-08,2020
1498,Fugue,Animation,English,Movie,Poland,120,Georges Schwizgebel,R,2,1,0,2020-09-08,2020
1499,Dead End,Adventure,English,Series,Switzerland,30,JeanBaptiste Andrea,R,7,5,0,2020-09-08,2020
1500,Record of Youth,Drama,Korean,Series,Lithuania,30,Steven Spielberg,TV-14,0,0,0,2020-09-07,2020

In [27]:
#Exporting it a csv 
#netflix_df.to_csv (r'C:\Users\sunny\Desktop\netflix_nivtan_final.csv', index = False, header=True)

## Data Model

![](netflix_ERD1.png "Title")


### Our netflix database has 5  entities.

Below are the tables names and a brief description of them:

  * movie : contains movie data such as title, type, runtime, box_office, netflix_release_date ,rating,awards,country               etc.
  
  * movie_director : contains the relationships between movies and directors.
  
  * director: contains director data including director's first name and last name.

  * genre : contains movies’s genre data such as genre id and genre of each movie.
 
  * language : stores language data like language id and name.

## DDL  for  tables

So, the first step in DDL would be creating a database and establishing connection with it.

## Connecting to database

For connecting to netflix database we will be importing psycopg2 which is a Python module and is also used to work with
the databases.

   * Below example depicts how we can connect to our netflix database using psycopg2:
        
conn = psycopg2.connect("host=localhost dbname=netflix user=postgres password=shanaya")

## Interacting with the database

* connect() returns a connection object representing the database.

* then we are creating a cursor object that helps in execution of SQL statements.


Here is the code that demonstrates how we can connect and interact database.We will be connecting to our netflix database in this case.

        import psycopg2

        conn = psycopg2.connect("host=localhost dbname=netflix user=postgres password=shanaya")

        cur = conn.cursor()

        cur.execute('SELECT * FROM movie)

## Creating  Table

* We use CREATE TABLE command with columns in the same order as the CSV file and their respective types. 

* This query should be executed after establishing a connection to the database

* We also create a cursor object by calling the cursor() method that belongs to the connection object. 
  This cursor object is used to actually execute your commands.

* We then call the execute() method of the cursor object to help us in creating the table. 

* Finally, we need to commit and close the connection. "Committing" the connection tells the driver to send the commands to the   database.

Below example demonstrates this:

cur = conn.cursor()

cur.execute("""

    CREATE TABLE tableName(
    
    column1 dataType1 PRIMARY KEY,
    
    column2 dataType2,
    
    ...
)

""")


conn.commit()   #For commiting changes


Each column[n] is a placeholder for the column name, dataType[n] is the data type you want to store for that column, and PRIMARY KEY is an example of an optional parameter to add on to the table.

## Creating tables for our netflix database

In [56]:
##importing python library psycopg2 inorder to work with databases.
import psycopg2

#Defining function for table creation

def create_tables():
    """ create tables in the PostgreSQL database"""
    commands = (
       """
        CREATE TABLE IF NOT EXISTS director(
            director_id INTEGER  PRIMARY KEY,
            first_name VARCHAR,
            last_name VARCHAR
        )
        """,
        """
       CREATE TABLE IF NOT EXISTS genre(
            genre_id INTEGER Primary Key,
            genre VARCHAR 
        )
        """,
        """
        CREATE TABLE IF NOT EXISTS language(
            language_id integer PRIMARY KEY,
            language VARCHAR 
        )
        """,
        """
        CREATE TABLE IF NOT EXISTS movie_director(
            movie_id INTEGER REFERENCES movie,
            director_id INTEGER REFERENCES director
   
        )
      """,
      """
        CREATE TABLE IF NOT EXISTS movie(
        movie_id INTEGER PRIMARY KEY,
        title VARCHAR,
        type VARCHAR,
        runtime INTEGER,
        box_office INTEGER,
        netflix_release_date DATE,
        rating VARCHAR,
        awards INTEGER,
        country VARCHAR,
        year NUMERIC,
        language_id integer REFERENCES language,
        genre_id INTEGER REFERENCES genre
   )
        """)
    
    conn = None
    try:
        # read the connection parameters
        # connect to the PostgreSQL server
        conn = psycopg2.connect(
           host="localhost",
           dbname= "netflix",
           user="postgres",
           password="shanaya"
        )
        cur = conn.cursor()
       
        # create table one by one
        for command in commands:
            cur.execute(command)
        # close communication with the PostgreSQL database server
        cur.close()
        # commit the changes
        conn.commit()
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
    finally:
        if conn is not None:
            conn.close()


if __name__ == '__main__':
    create_tables()

## Loading data

The method to load a file into a table is called copy_from .It takes in a file (like a CSV) and automatically 
loads the file into a Postgres table.


First, we are loading movie data

In [63]:
##importing python library psycopg2 inorder to work with databases.
import psycopg2


#connect to the database
conn = psycopg2.connect(
           host="localhost",
           dbname= "netflix",
           user="postgres",
           password="shanaya"
)
#create a cursor object 
#cursor object is used to interact with the database
cur = conn.cursor()

#copy file into the created table 
with open('movie_file.csv', 'r') as f:
    cur.copy_from(f, 'movie', sep=',')

    
#Commit Changes    
conn.commit()

loading movie_director

In [59]:
##importing python library psycopg2 inorder to work with databases.
import psycopg2

#connect to the database
conn = psycopg2.connect(
           host="localhost",
           dbname= "netflix",
           user="postgres",
           password="shanaya"
)
#create a cursor object
#cursor object is used to interact with the database
cur = conn.cursor()

#copy file into created table
with open('movie_director.csv', 'r') as f:
    cur.copy_from(f, 'movie_director', sep=',')
    
#commit changes
conn.commit()

Here we are loading director data

In [60]:
##importing python library psycopg2 inorder to work with databases.
import psycopg2

#connect to the database
conn = psycopg2.connect(
           host="localhost",
           dbname= "netflix",
           user="postgres",
           password="shanaya"
)
#create a cursor object 
#cursor object is used to interact with the database
cur = conn.cursor()

#copy file into the created table 
with open('director_file.csv', 'r') as f:
    cur.copy_from(f, 'director', sep=',')

#Commit Changes  
conn.commit()

Then loading genre data

In [61]:
##importing python library psycopg2 inorder to work with databases.
import psycopg2

#connect to the database
conn = psycopg2.connect(
           host="localhost",
           dbname= "netflix",
           user="postgres",
           password="shanaya"
)
#create a cursor object
#cursor object is used to interact with the database
cur = conn.cursor()

#copy file into created table
with open('genre_file.csv', 'r') as f:
    cur.copy_from(f, 'genre', sep=',')

#commit changes
conn.commit()

Finally, loading our language data

In [62]:
##importing python library psycopg2 inorder to work with databases.
import psycopg2

#connect to the database
conn = psycopg2.connect(
           host="localhost",
           dbname= "netflix",
           user="postgres",
           password="shanaya"
)

#create a cursor object
#cursor object is used to interact with the database
cur = conn.cursor()

#copy file into created table
with open('language_file.csv', 'r') as f:
    cur.copy_from(f, 'language', sep=',')
    
#commit changes
conn.commit()

## Reading Data From Database using (read_sql)

Here we are reading data from our tables(movie,movie_director ,director,genre,language) to a pandas DataFrame.We call pd.read_sql() for achieving this and passing the database connection obtained from the SQLAlchemy Engine as a parameter.

Importing libraries

In [1]:
##importing python library psycopg2 inorder to work with databases.
import psycopg2

#importing pandas
import pandas as pd

#To read from and write to SQL end-points like PostgreSQL the pandas DataFrame class uses the SQLAlchemy engine.
from sqlalchemy import create_engine

#Create an engine instance

alchemyEngine  = create_engine('postgresql+psycopg2://postgres:shanaya@localhost:5432/netflix') # this is our connection string

In [2]:
#Connect to PostgreSQL server

dbConnection = alchemyEngine.connect();

In [3]:
#Read data from PostgreSQL database table and load into a DataFrame instance


dataFrame  = pd.read_sql_table("movie", dbConnection);
print(dataFrame)

# Close the database connection

#dbConnection.close();

      movie_id                title    type  runtime  box_office  \
0            1     Lets Fight Ghost  Series       30     2122065
1            2  HOW TO BUILD A GIRL   Movie      120       70632
2            3           Centigrade   Movie      120       16263
3            4                 ANNE  Series       30           0
4            5                Moxie   Movie      120           0
...        ...                  ...     ...      ...         ...
1496      1497             The Exam   Movie      120           0
1497      1498                Cargo   Movie      120           0
1498      1499                Fugue   Movie      120           0
1499      1500             Dead End  Series       30           0
1500      1501      Record of Youth  Series       30           0

     netflix_release_date   rating  awards      country    year  language_id  \
0              2021-03-04        R      74     Thailand  2021.0           44
1              2021-03-04        R       1       Canada  2021.0           11
2              2021-03-04  Unrated       0       Canada  2021.0           11
3              2021-03-04        R       1      Belgium  2021.0           50
4              2021-03-04        R       0    Lithuania  2021.0           11
...                   ...      ...     ...          ...     ...          ...
1496           2020-09-09        R       4      Hungary  2020.0           18
1497           2020-09-08    TV-MA       1    Lithuania  2020.0           11
1498           2020-09-08        R       2       Poland  2020.0           11
1499           2020-09-08        R       7  Switzerland  2020.0           11
1500           2020-09-07    TV-14       0    Lithuania  2020.0           24

      genre_id
0            6
1            5
2            8
3            8
4            3
...        ...
1496         8
1497         8
1498         3
1499         2
1500         8

[1501 rows x 12 columns]

### For reading  SQL query into  a dataframe we use 

Pd.read_sql _query()

## Query Execution

In [45]:
#List all movies released in english and dutch
#In my select statement  I have selected  movie.title and language.language  
#from movie table and then further joined it to language table using joins. Inner join are 
#basically used to get records which are common in both tables  and then I have used the IN operator 
#to specify multiple language values in where clause.


query_1 = '''Select movie.title , language.language
from movie 
inner join language 
on movie.language_id = language.language_id
where language IN ('Dutch','English')
order by language'''

In [9]:
#Read SQL query into a DataFrame

df1 = pd.read_sql_query(query_1,dbConnection).head(100)
df1

                          title language
0                    My Giraffe    Dutch
1      De Piraten van Hiernaast    Dutch
2   No Such Thing as Housewives    Dutch
3                  Hartenstrijd    Dutch
4                         Yummy    Dutch
..                          ...      ...
95               The Unsettling  English
96                  Zac and Mia  English
97                   My Dead Ex  English
98                   Love Daily  English
99                  Stolen face  English

[100 rows x 2 columns]

In [12]:
#Show all movies released between '2021/1/5' and '2021/3/3'*
#For finding release date of all  movies  between a given date range I have used Between in the where clause. 
#The BETWEEN operator selects values within a given range.

query_2 = '''
select title,type,rating,netflix_release_date
from movie
WHERE netflix_release_date 
BETWEEN '2021/1/5' and '2021/3/3'
order by netflix_release_date desc
'''
##Read SQL query into a DataFrame
df2 = pd.read_sql_query(query_2,dbConnection)
df2

                       title    type rating netflix_release_date
0            The ConHeartist   Movie      R           2021-03-03
1               Gleboka woda  Series      R           2021-03-03
2                   Instynkt  Series      R           2021-03-03
3              Only a Mother   Movie      R           2021-03-03
4                 Snowroller   Movie      R           2021-03-03
..                       ...     ...    ...                  ...
383             Back to Life  Series  TV-MA           2021-01-05
384            Girls Secrets   Movie  TV-MA           2021-01-05
385              Azizs Dream   Movie      R           2021-01-05
386                 Africano   Movie      R           2021-01-05
387  The Wolf of Snow Hollow   Movie      R           2021-01-05

[388 rows x 4 columns]

In [40]:
#List of directors who have directed movies where genre = "Action and country = Japan

#In this query we have joined movie to movie_director on movie_id , movie_director to director on director_id and 
#movie to genre on genre_id  in order to get records from these tables and then used a where clause to get list of
#Action movies in Japan.



query_3 = '''
 
SELECT first_name,last_name,genre,title,country from movie
join movie_director
on movie.movie_id = movie_director.movie_id
join director
on director.director_id = movie_director.director_id 
join genre
on genre.genre_id = movie.genre_id
where genre='Action' AND country='Japan'
order by genre;
'''

df3 = pd.read_sql_query(query_3,dbConnection)
df3.tail()

,first_name,last_name,genre,title,country
33,Chang,Won,Action,The Swindlers,Japan
34,JK,Youn,Action,Tidal Wave,Japan
35,Ishir,Honda,Action,The War of the Gargantuas,Japan
36,SABU,,Action,Hard Luck Hero,Japan
37,Cathy,Yan,Action,Birds of Prey And the Fantabulous Emancipation...,Japan

In [ ]:
# Here WE have created a view for the above query:
#Suppose we want to get information like  director names,genre,title and country we would normally 
#be using a join statement.
#This query  sometimes gets complex. SO for this we can create views and whenever we want to see this data, 
#we can  just query it from the view by executing the simple SELECT statement

#In general 
#A view can be very useful in some cases such as:
#A view helps simplify the complexity of a query because you can query a view, which is based on a complex query, 
#using a simple SELECT statement.
#Like a table, you can grant permission to users through a view that contains specific
#data that the users are authorized to see.

view_query = '''
CREATE view movies_of_action_genre As 
SELECT first_name,last_name,genre,title,country from movie
join movie_director
on movie.movie_id = movie_director.movie_id
join director
on director.director_id = movie_director.director_id 
join genre
on genre.genre_id = movie.genre_id
where genre='Action' AND country='Japan'
order by genre;
'''
Select * from movies_of_action_genre
#pd.read_sql_query(view_query,dbConnection)

In [15]:
# Give list of movies with duration of 120 minutes
#we have just selected title and runtime from movie table and then further used the where clause  
#to get movies/series which have a runtime of 120 minutes.

query_4= '''Select title,runtime
from movie 
where runtime=120
'''

In [20]:
df4 = pd.read_sql_query(query_4,dbConnection)
df4

                   title  runtime
0    HOW TO BUILD A GIRL      120
1             Centigrade      120
2                  Moxie      120
3          Only a Mother      120
4             Snowroller      120
..                   ...      ...
977            The Squad      120
978      Sinister Shadow      120
979             The Exam      120
980                Cargo      120
981                Fugue      120

[982 rows x 2 columns]

In [17]:
# Which country has the most number of titles produced
#For this I  have just selected title and country  from movie table and then further grouped 
#the results by country .For sorting we have used order by.
#Also,I have given title an alias name 

query_5 = '''Select count(title) As "number of movies produced" ,country
from movie 
group by country
order by count(title) desc
'''

In [18]:
df5 = pd.read_sql_query(query_5,dbConnection)
df5.head()

   number of movies produced      country
0                        236    Lithuania
1                        186        Japan
2                        137  South Korea
3                         83     Thailand
4                         79       Canada

In [21]:
# What are most popular ratings on Netflix 
#For getting the movies with most popular rating we have selected count(title) and rating from movie table
#and then grouped by rating.

query_6 = '''Select Count(title) As "popular ratings count" ,rating
from movie 
group by rating
order by Count(title) DESC
'''

In [22]:
df6 =pd.read_sql_query(query_6,dbConnection)
df6.head(10)

   popular ratings count   rating
0                    934        R
1                    164  Unrated
2                     86    TV-MA
3                     78    PG-13
4                     69    TV-14
5                     58       PG
6                     32    TV-PG
7                     26     TV-G
8                     12        G
9                     12     TV-Y

In [77]:
# Suppose we want to find the movies whose runtime is higher than the average runtime

#First we are finding avg runtime 
query_7a = '''
Select avg(runtime)
from movie
'''

df = pd.read_sql_query(query_7a,dbConnection)
df

          avg
0  103.617588

In [83]:
# Suppose we want to find the movies whose runtime is higher than the average runtime


query_7b = '''SELECT  movie_id,title,runtime
FROM movie
WHERE runtime > (SELECT avg (runtime) FROM movie)

'''

In [84]:
df7 =pd.read_sql_query(query_7b,dbConnection)
df7

#We are able to see only those movies whose rumtime is greater than the avg runtime

      movie_id                title  runtime
0            2  HOW TO BUILD A GIRL      120
1            3           Centigrade      120
2            5                Moxie      120
3            6      The ConHeartist      170
4            9        Only a Mother      120
...        ...                  ...      ...
1135      1495            The Squad      120
1136      1496      Sinister Shadow      120
1137      1497             The Exam      120
1138      1498                Cargo      120
1139      1499                Fugue      120

[1140 rows x 3 columns]

In [26]:
# Count of titles based on genre
#movie -->genre  tables are used to answer this query.
#In order to fetch records from the above tables we have joined them on genre_id which is the common 
#for both tables  and then further grouped by genre.
#In order to make the code more readable I have given an alias name for movie ,movie title,genre


query_8 = '''SELECT count(m.title) As "title count based on genre",g.genre
FROM movie as m
inner join genre  as g
on g.genre_id = m.genre_id
group by g.genre
order by  count(m.title) DESC
'''

In [27]:
df8 = pd.read_sql_query(query_8,dbConnection)
df8.head()

   title count based on genre        genre
0                         376       Comedy
1                         363        Drama
2                         187       Action
3                         125    Animation
4                          88  Documentary

In [41]:
#List of directors who have directed spanish movies*/
#In this query we have joined movie to movie_director on movie_id , movie_director to director on director_id and 
#movie to language on language_id  in order to get records from these tables and then used a where clause to get list of
#Spanish movies

query_9 = '''

SELECT director.first_name,director.last_name,title,type,language from movie
join movie_director
on movie.movie_id = movie_director.movie_id
join director
on director.director_id = movie_director.director_id 
join language
on language.language_id = movie.language_id
where language='Spanish' and type = 'Movie'
'''

df9 = pd.read_sql_query(query_9,dbConnection)
df9.head()

  first_name last_name            title   type language
0        Jos   Esteban  To Kill a Child  Movie  Spanish
1      Pablo    Larran             Fuga  Movie  Spanish
2      Maite   Alberdi   The Mole Agent  Movie  Spanish
3    Esteban    Crespo      Black Beach  Movie  Spanish
4    Gerardo   Herrero        Al acecho  Movie  Spanish

In [34]:
# Display language of movie named "Joker"
#For this I have used  movie -->language  tables 
#I have joined the two tables on language_id which is common in both tables. language_id acts as  
#the pk for language table and fk for the movie table 
#In the where clause I have used  title = joker in order to get the language for it.

query_10 = '''
select movie_id,title, language
from language l
inner join movie m 
on l.language_id = m.language_id
where title = 'Joker'
Order by language DESC'''

In [35]:
df10 = pd.read_sql_query(query_10,dbConnection)
df10

   movie_id  title language
0        16  Joker  English

## Summary

Finally in this project we analyzed the netflix dataset and were successful in achieving the folllowing :
 * establishing connection between python and Postgres using psycopg2 library
 * loading files into Postgres tables using the psycopg2.copy_from() 
 * executing the SQL queries and reading it back to the pandas dataframe using pd.read_sql()